# -*- coding: utf-8 -*-
"""
Created on Mon Apr 13 18:15:45 2026

@author: Andrey
"""

import os
import zipfile

# %%
# =============================================================================

#  Задача 1: Создание архива
# Напишите функцию, которая:
#
# Создает ZIP архив backup.zip
#
# Добавляет в него все файлы из папки test_folder/ (включая подпапки)
#
# Использует сжатие ZIP_DEFLATED
#
# Выводит список добавленных файлов
#
# python
# def task_1_create_zip():
#     """Создает ZIP архив из папки test_folder."""
#     # Ваш код здесь
#     pass
# =============================================================================


def task_1():
    # create zip backup
    with zipfile.ZipFile(
        "backup.zip", "w", compression=zipfile.ZIP_DEFLATED
    ) as archive:
        here = os.path.dirname(os.path.abspath(__file__))
        dir_path = os.path.abspath(here + "\\test_folder")

        for root, dirs, files in os.walk(dir_path):
            for file in files:
                full_path = os.path.join(root, file)
                arcname = os.path.relpath(full_path, start=dir_path)
                print(full_path, arcname)
                archive.write(full_path, arcname)
            if not files and not dirs:
                folder_arc = os.path.relpath(root, start=dir_path) + "/"
                print(folder_arc)
                archive.writestr(folder_arc, "")
    pass


task_1()

# %%
# =============================================================================
# ⭐⭐ Задача 2: Просмотр содержимого архива
# Напишите функцию, которая:
#
# Открывает архив backup.zip
#
# Выводит список всех файлов с их размерами
#
# Показывает общий размер архива
#
# Выводит количество файлов в архиве
#
# python
# def task_2_list_zip():
#     """Выводит содержимое ZIP архива с информацией о файлах."""
#     # Ваш код здесь
#     pass
# =============================================================================


# %%
# =============================================================================
# ⭐⭐ Задача 3: Извлечение по расширению
# Напишите функцию, которая:
#
# Открывает архив backup.zip
#
# Извлекает только .txt файлы в папку extracted_txt/
#
# Сохраняет структуру подпапок
#
# Выводит количество извлеченных файлов
#
# python
# def task_3_extract_txt_only():
#     """Извлекает только текстовые файлы из архива."""
#     # Ваш код здесь
#     pass
# =============================================================================


# %%
# =============================================================================
# ⭐⭐⭐ Задача 4: Добавление файлов в существующий архив
# Напишите функцию, которая:
#
# Открывает существующий архив backup.zip в режиме добавления
#
# Создает новый файл new_file.txt со случайным содержимым
#
# Добавляет его в архив
#
# Не удаляет и не перезаписывает существующие файлы
#
# python
# def task_4_add_to_zip():
#     """Добавляет новый файл в существующий архив."""
#     # Ваш код здесь
#     pass
# =============================================================================


# %%
# =============================================================================
# ⭐⭐⭐ Задача 5: Поиск файлов в архиве
# Напишите функцию, которая:
#
# Принимает название архива и поисковый запрос (строку)
#
# Ищет в архиве файлы, содержащие этот запрос в имени
#
# Для найденных файлов показывает:
#
# Имя файла
#
# Размер
#
# Степень сжатия
#
# Возвращает список найденных файлов
#
# python
# def task_5_search_in_zip(zip_path, search_term):
#     """Ищет файлы в архиве по имени."""
#     # Ваш код здесь
#     pass
# =============================================================================


# %%
# =============================================================================
# ⭐⭐⭐⭐ Задача 6: Распаковка с преобразованием
# Напишите функцию, которая:
#
# Открывает архив backup.zip
#
# Читает содержимое каждого .txt файла без извлечения на диск
#
# Подсчитывает в каждом файле:
#
# Количество строк
#
# Количество слов
#
# Количество символов
#
# Сохраняет результаты в CSV файл analysis.csv
#
# Выводит статистику на экран
#
# python
# def task_6_analyze_in_zip():
#     """Анализирует текстовые файлы внутри архива без извлечения."""
#     # Ваш код здесь
#     pass
# =============================================================================


# %%
# =============================================================================
# 📊 Дополнительная задача (⭐️⭐️⭐️⭐️⭐️)
# Задача 7: Синхронизация папки с архивом
# Напишите функцию, которая:
#
# Принимает путь к папке и путь к ZIP архиву
#
# Сравнивает содержимое папки с архивом
#
# Добавляет в архив новые файлы из папки
#
# Обновляет измененные файлы
#
# Удаляет из архива файлы, которых больше нет в папке
#
# Выводит отчет о синхронизации
#
# python
# def task_7_sync_folder_with_zip(folder_path, zip_path):
#     """Синхронизирует папку с ZIP архивом (двусторонняя синхронизация)."""
#     # Ваш код здесь
#     pass
# =============================================================================
