# -*- coding: utf-8 -*-
# =============================================================================
#
# Created on Tue Apr  7 16:54:28 2026
#
# @author: Andrey
#
# =============================================================================
import json

# =============================================================================
# %% 📚 Задача 1: Загрузка и базовый анализ

# Напишите функцию, которая:
# 1) Загружает JSON файл (university.json)
# 2) Выводит основную информацию:
#   a) Название университета, год основания
#   b) Список факультетов
#   c) Общее количество студентов
#   d) Количество студентов на каждом факультете
# 3) Сохраняет эту статистику в файл university_stats.json


def task_1():
    new_data = dict()
    with open("university.json", "r", encoding="utf-8") as file:
        data = json.load(file)
        print(
            f"{data['university']['name']} был основан в {
                data['university']['founded']
            } году."
        )
        print("Включает в себя факультеты:")
        for i, department in enumerate(
            data["university"]["departments"], start=1
        ):
            print(
                f"\t{i}) {department['name']} ({
                    department['id']
                }) - Руководитель: {department['head']}"
            )

        student_count = len(data["students"])
        new_data["university"] = {
            "name": data["university"]["name"],
            "founded": data["university"]["founded"],
            "departments": [],
            "total_student_count": student_count,
        }

        print(f"\nВ университете числится {student_count} студентов.")
        print("Количество студентов на каждом из факультетов:")
        for department in data["university"]["departments"]:
            student_per_department = len(
                [
                    x
                    for x in data["students"]
                    if x["department"] == department["id"]
                ]
            )
            new_data["university"]["departments"].append(
                {
                    "id": department["id"],
                    "name": department["name"],
                    "students_count": student_per_department,
                }
            )
            print(f"\t{department['name']} - {student_per_department} чел.")

    with open("university_stats.json", "w", encoding="utf-8") as file:
        json.dump(new_data, file, indent=4, ensure_ascii=False)


task_1()

# %% 📚 Задача 2: Поиск и фильтрация студентов

# Напишите функцию, которая принимает критерии поиска и возвращает список
# студентов, удовлетворяющих условиям:
#   Параметры:
#   min_age — минимальный возраст
#   department — факультет (опционально)
#   min_average_score — минимальный средний балл
#
# Функция должна возвращать список студентов с их средним баллом,
# отсортированных по убыванию среднего балла.
# Пример использования:
#
# result = task_2(min_age=20, department="CS", min_average_score=75)
# Должен вернуть студентов CS факультета старше 20 лет со средним баллом > 75


def task_2(min_age, min_average_score, department=None):
    student_list = list()
    with open("university.json", "r", encoding="utf-8") as file:
        data = json.load(file)
        for student in data["students"]:
            subject_score_sum = sum(
                subject["score"] for subject in student["grades"]
            )
            subject_count = len(student["grades"])
            avg_score = round(subject_score_sum / subject_count, 1)
            if (
                student["age"] >= min_age
                and (department is None or student["department"] == department)
                and avg_score >= min_average_score
            ):
                student_list.append((student["name"], avg_score))
    student_list = sorted(student_list, key=lambda x: -x[1])
    return student_list


result = task_2(min_age=19, min_average_score=75)
for student in result:
    print(f"{student[0]}: {student[1]}")


# %% 📚 Задача 3: Анализ успеваемости по факультетам

# Создайте функцию, которая генерирует отчет по успеваемости для каждого
# факультета.
# Отчет должен содержать:
#   1) Название факультета
#   2) Количество студентов
#   3) Средний балл по факультету (по всем предметам всех студентов)
#   4) Лучший предмет на факультете (с наибольшим средним баллом)
#   5) Худший предмет на факультете
#   6) Список отличников (средний балл >= 85)
#
# Результат сохраните в файл department_report.json.


# %% 📚 Задача 4: Добавление и обновление данных

# Создайте функции для управления данными студентов:
# add_student(student_data) — добавляет нового студента (генерирует новый id)
# update_student_grades(student_id, new_grades) — обновляет оценки студента
# delete_student(student_id) — удаляет студента по id
#
# Все изменения должны сохраняться в файл.


# %% 📚 Задача 5: Анализ динамики успеваемости

# Создайте функцию, которая анализирует динамику оценок.
# Для каждого студента определите:
#   1) Улучшил ли он успеваемость (средний балл последних двух оценок выше первых двух)
#   2) Какие предметы имеют тенденцию к улучшению/ухудшению
#
# Результат должен быть сохранен в performance_analysis.json.


# %% 📚 Задача 6: Экспорт в различные форматы

# Создайте функции для экспорта данных:
# export_to_csv() — экспортирует список студентов с их средними баллами в CSV
# export_to_json_compact() — экспортирует минифицированную версию исходного JSON
# export_summary_txt() — создает текстовый отчет в читаемом формате


# %% 📚 Задача 7: Валидация и очистка данных

# Создайте функцию, которая проверяет целостность данных и исправляет ошибки:
# Проверки:
#   a) У всех студентов должны быть заполнены все поля
#   b) Оценки должны быть в диапазоне 0-100
#   c) Дата должна быть в формате YYYY-MM-DD
#   d) id должны быть уникальными
#
# Если найдены ошибки, функция должна:
#   a) Вывести предупреждения
#   b) Исправить автоматически (если возможно)
#
# Создать файл validation_report.json с отчетом об ошибках


# %% 📚 Задача 8: Слияние данных из нескольких источников

# Создайте функцию, которая объединяет данные из двух JSON файлов:
# Допустим, есть второй файл new_students.json с новыми студентами и
# обновленной информацией о существующих.
# Правила слияния:
#   a) Если студент с таким id существует — обновить его данные
#   b) Если нет — добавить нового
#   c) При конфликте данных приоритет у нового файла


# %% 📚 Задача 9: Сложные запросы и агрегации

# Создайте функцию для выполнения сложных запросов:
# Функция принимает запрос в виде JSON:
#
# json
# {
#   "filter": {
#     "department": "CS",
#     "age": {"min": 19, "max": 21},
#     "year": [2, 3]
#   },
#   "aggregate": {
#     "group_by": "year",
#     "metrics": ["count", "avg_score", "max_score"]
#   },
#   "sort_by": "avg_score",
#   "order": "desc"
# }
# Должна возвращать результат, соответствующий запросу.


# %% 📚 Задача 10: Полный цикл обработки данных

# Создайте комплексную программу, которая:
# 1) Загружает данные из university.json
# 2) Выполняет валидацию и очистку
# 3) Добавляет нового студента (ввод данных через консоль)
# 4) Обновляет оценки существующего студента
# 5) Генерирует полный отчет по университету:
#    a) Статистика по факультетам
#    b) Рейтинг студентов
#    c) Анализ успеваемости по годам
#    d) Рекомендации по отчислению (студенты с средним баллом < 60)
#    e) Сохраняет все отчеты в отдельную папку reports/
#    f) Создает бэкап исходного JSON перед изменениями


# %% ==========================================================================

# # 📊 Критерии оценки
# # Уровень	Задачи	Навыки
# # Базовый	1-2	Чтение, загрузка, простая фильтрация
# # Средний	3-5	Агрегация, модификация, обновление
# # Продвинутый	6-8	Экспорт, валидация, слияние
# # Экспертный	9-10	Сложные запросы, полный цикл обработки

# # 💡 Советы
# # Используйте json модуль — все задачи решаются им
# # Создавайте вспомогательные функции для повторяющихся операций
# # Обрабатывайте ошибки — файл может отсутствовать, данные могут быть некорректными
# # Сохраняйте бэкапы перед изменениями (особенно в задаче 10)
# # Пишите docstring для каждой функции

# # Удачи в решении! 🎉
# =============================================================================
